Repository: 84000/data-translation-memory
Catalog: toh4568-3-v3.tmx
Source language: bo
Languages: en

source: ༄༅། །ཛཱཛྫཱཏེཥུསཪྻྻཾརཏྣཱརཛཱཿསུཡནཱཏྲ། །སུབྷྲདྷརྨྨསམཱཁཱཏམབྷཡནྣརེནྡྲམེརུཏཱ། །
en: jātāj jāteṣu satkāryaṃ ratnā rajāḥ sucāyanāt | śubhradharmasamākhātam abhūn narendramerutā ||

source: སྐྱེས་ནས་སྐྱེ་བར་ལེགས་བྱས་ཀྱི། །
en: Through accumulating an abundance

source: རིན་ཆེན་རྡུལ་མང་བསགས་པ་ལས། །
en: Of the jewel dust of great deeds across lifetimes, The mighty mountain, the Lord of Men, has appeared,

source: རབ་དཀར་ཆོས་ཀྱི་རྫིང་བཞིན་དུ། །
en: Like a wellspring of pure Dharma.

source: གྱུར་པ་མི་དབང་ལྷུན་པོ་བྱུང་། །
en: Most rulers of men resemble drunken elephants

source: མི་བདག་ཕལ་ཆེར་འདོད་པ་ཡིས། །
en: Intoxicated by the liquor of desires;

source: ཆང་གིས་རབ་དྲེགས་གླང་པོ་བཞིན། །
en: They needlessly destroy the very reeds

source: རང་ཉིད་བཟའ་བའི་འདམ་བུ་ཡང་། །ཉེས་པ་མེད་པར་འཇོམས་པ་ཡོད། །
en: That they themselves eat.

source: འདི་ནི་བསྐལ་པར་བསོད་ནམས་ལ། །
en: I have witnessed how merit, accumulated across eons,

source: གོམས་པས་ཐོག་མར་གཞན་བསྲུངས་ཤིང་། །
en: Leads one to have concern for others,

source: དེ་ཡིས་རང་ཉིད་བདེ་བའི་རྒྱུ། །
en: And, through that, the causes for one’s own happiness

source: འབད་པ་མེད་པར་གྲུབ་པ་མཐོང་། །
en: Fully manifest without any effort at all.

source: འགྲོ་བའི་བདེ་བ་ལེགས་སྤྱད་ལས། །
en: The happiness of beings arises from wholesome deeds,

source: དེ་ཡང་ཐུབ་མཆོག་གསུང་ལས་སྐྱེས། །
en: And those, in turn, arise from the words of the Supreme Sage;

source: དེ་ཡང་ཡི་གེ་ལ་བརྟེན་ཕྱིར། །
en: Since those, in turn, depend upon the written word,

source: མི་བདག་བློ་གྲོས་དེ་རྗེས་སོང་། །
en: The Ruler of Men, in his wisdom, has followed suit.

source: སྙིང་སྟོབས་དྲི་མེད་སྟོན་ཟླ་བཞིན། །
en: With a courageous spirit as brilliant As the stainless autumn moon,

source: གསལ་བས་བརྩོན་འགྲུས་ཚེ་རྩོམ་པ། །ཆུ་གཏེར་ལྟ་བུར་འཕེལ་གྱུར་པས། །
en: And diligent effort surging like the ocean,

source: དཔག་བསམ་སར་པ་འདི་བྱུང་ངོ༌། །
en: The wish-fulfilling tree has been born anew.

source: དེ་ལྟར་བསིལ་ལྡན་གྱི་ལྗོངས་འདིར་དམ་པའི་ཆོས་ཀྱི་དབུ་བརྙེས་པ་ནས་བཟུང་སྟེ་ད་ལྟའི་བར་དུ་བདག་ཅག་གི་སྟོན་པ་མཉམ་མེད་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱའི་དབང་པོའི་གསུང་རབ་འཁྲུལ་པ་མེད་པ་ཅི་ཙམ་ཞིག་སྣང་བར་གྱུར་པ་དེ་དག་ལས་དེང་སང་ཕྱི་མོ་ཇི་ཙམ་སྙེད་པ་དག་མིའི་དབང་པོ་བསྟན་པ་ཚེ་རིང་ཡབ་སྲས་ཀྱི་བདག་རྐྱེན་ལས་པར་དུ་བསྒྲུབས་པའི་ཚུལ་གླེང་བ་ལ་གཉིས་ཏེ་བདག་རྐྱེན་བྱེད་པ་པོའི་ལོ་རྒྱུས་འཆད་པ་དང་།
en: This account, which describes how all those source texts still extant today of all the genuine scriptures of our teacher—the peerless, perfect, and complete Buddha, the Lord of the Śākyas—that have appeared in this Cool Land since the first introduction of the holy Dharma until the present were put into print through the sponsorship of the Lord of Men, Tenpa Tsering, and family, is divided into two sections: an account of the history of the main initiator, and an account of the virtuous activities undertaken.

source: རྣམ་དཀར་གྱི་བྱ་བ་དངོས་སྨོས་པའོ། །
en: The History of the Patron, King Tenpa Tsering

source: དང་པོ་ལ་ཡུལ་རིགས་ཡོན་ཏན་གསུམ་གྱི་སྒོ་ནས་འཆད་པ་ལ།
en: Part 1 The first is discussed from three perspectives: location, family lineage, and qualities. 1.1 Location

source: དང་པོ་ནི་སྤྱིར་ཀི་ལཱ་ཤའི་ར་བས་ཡོངས་སུ་བསྐོར་བའི་ལྗོངས་བྱང་ཕྱོགས་བོད་ཀྱི་ཡུལ་འདི་ཉིད།
en: The location in general is Tibet, the land of the north, encircled by ranges of snowy mountains.

source: འཇམ་དཔལ་རྩ་རྒྱུད་ལས།
en: The Root Manual of the Rites of Mañjuśrī states:

source: ཁ་བ་ཅན་དུ་མཚོ་བྲི་ནས། །སཱ་ལའི་ནགས་ནི་འབྱུང་བར་འགྱུར། །
en: After the lake has receded from the Land of Snows It will be covered by groves of sāla trees.

source: ཞེས་ལུང་བསྟན་པ་ལྟར་དང་པོར་མཚོ་ཡོད་པར་རིམ་གྱིས་བྲི་ནས་ནགས་ཚལ་སྟུག་པོ་རྒྱས་པར་གྱུར་པའི་སྐབས་ཤིག་ན།
en: As stated in this prophecy, Tibet was first a lake that gradually dried up, giving way to dense forest.

source: ཡུལ་གྲུ་འཛིན་ནས་ཐུགས་རྗེ་ཆེན་པོས་བྱིན་གྱིས་བརླབས་པའི་སྤྲེའུ་ཞིག་འོངས་པ་དེ་དང་བྲག་སྲིན་མོ་འདུས་པ་ལས།
en: At one point, a monkey blessed by the Great Compassionate One arrived from the land of Potalaka.

source: བོད་རྣམས་ཉེ་བར་མཆེད་པ་ཡིན་ཞེས་ཀྱང་ཟེར།
en: It is said that the Tibetan people are descended from his union with a cliff ogress.

source: ལྷ་ལས་ཕུལ་བྱུང་གི་བསྟོད་འགྲེལ་ལས།
en: However, the commentary to The Praise Surpassing Even That of the Gods states:

source: ཁྱབ་འཇུག་གིས་ནི་འཐབ་དཀའ་ཞེས་བྱ་བ་ལ་སོགས་པའི་རིགས་བརྒྱུད་བརླག་པར་གྱུར་པ་ཡིན་ཏེ།
en: “Viṣṇu is known to have annihilated the family of Duryodhana and others.”

source: འདི་ལྟར་ཁྱབ་འཇུག་གིས་འཐབ་དཀའ་ལ་དྲིས་པ། དཔུང་ཚོགས་བཅོ་བརྒྱད་ཁྱེར་རམ། འོན་ཏེ་ནོར་ལྷ་གཅིག་པུ་ཁྱེར་ཞེས་དྲིས་པ་དང་། དེས་དཔུང་གི་ཚོགས་རྣམས་ཁྱེར་རོ་ཞེས་སྨྲས་པ་དང་། དེས་ཞེ་འགྲས་པར་གྱུར་ནས།
en: “Viṣṇu asked Duryodhana, ‘Would you rather bring the eighteen armies or Vāsudeva alone?’ “He replied, ‘I will bring the armies,’ thus becoming Viṣṇu’s enemy.

source: ཁྱབ་འཇུག་གིས་སྐྱ་བསེང་གི་ཕྱོགས་བྱས་ཏེ་གཡུལ་ངོར་ཆས་པ་ན། སྲིད་སྒྲུབ་ཀྱིས་ཀུན་དུ་བལྟས་ཏེ་སྨྲས་པ། ཁོ་བོས་ནི་ཉེ་དུའི་ཚོགས་གསོད་པར་མི་ནུས་ཏེ། གང་གི་དོན་དུ་རྒྱལ་སྲིད་ཐོབ་པར་འདོད་པའི་ཉེ་དུའི་ཚོགས་དེ་ཇི་ལྟར་གསད་པར་བྱ་ཞེས་སྨྲས་ཏེ་སྲིད་སྒྲུབ་འཐབ་པ་ལས་ལྡོག་པར་གྱུར་པ་དང་། ཁྱབ་འཇུག་གིས་སྨྲས་པ། ཁྱེད་ནི་བླུན་པ་ཡིན་ཏེ།
en: “Then, when Viṣṇu arrived at the battleground on the side of Pāṇḍu, Arjuna looked around and said, ‘I could never kill my own kinsmen, so how could I kill these armies of my kinsmen, even if they wish to capture the kingdom?’ “When Arjuna turned his back on the battle, Viṣṇu cried out, ‘You are a fool!

source: གང་གིས་མི་ནི་གསད་པ་དང་། །གང་ཞིག་གསོད་པར་བྱེད་པ་དག །དེ་དག་གཉི་ག་མི་དམིགས་ཏེ། །
en: “ ‘Neither he who kills Nor he who is killed Has any perceptible basis;

source: གསད་དང་གསོད་པ་པོ་ཡོད་མིན། །
en: Killer and killed do not exist.

source: རིགས་དང་འདུལ་བ་ཕུན་སུམ་ཚོགས། །བྲམ་ཟེ་བ་ལང་གླང་པོ་དང་། །ཁྱི་དང་སྨེ་ཤ་ཅན་དག་དང་། །མཁས་པ་རྣམས་ནི་མཉམ་པར་ལྟ། །
en: “ ‘Those of superior learning and discipline, Brahmins, cows, and oxen, Dogs, outcastes, paṇḍitas, and the like— All should be viewed as the same.’

source: ཞེས་བྱ་བ་ལ་སོགས་པ་མེད་པར་ལྟ་བའི་ཚིགས་སུ་བཅད་པ་མང་པོ་བསྟན་ཅིང་། སྣ་ཚོགས་པའི་གཟུགས་བསྟན་པས་བསླུས་ནས། སྲིད་སྒྲུབ་ཀྱི་ཁ་ལོ་བ་རང་ཉིད་ཀྱིས་བྱས་ཏེ། གཡུལ་བཀྱེ་བས་འཐབ་དཀའི་རིགས་དཔུང་གི་ཚོགས་བཅོ་བརྒྱད་དང་བཅས་པ་བརླག་པར་གྱུར་ཏོ། །
en: “Teaching him with these and many other verses of nihilist views, Viṣṇu deceived him by displaying various forms, and, taking the form of Arjuna’s charioteer, the family of Duryodhana and its eighteen armies were wiped out.

source: རཱུ་པ་ཏི་ཞེས་བྱ་བའི་རྒྱལ་པོ་དཔུང་གི་ཚོགས་གཅིག་དང་བཅས་པ་གཡུལ་འགྱེད་པའི་ཚེ་བུད་མེད་ཀྱི་ཆ་ལུགས་སུ་བྱས་ཏེ་བྲོས་ནས་རི་ཁ་བ་ཅན་གྱི་རི་ཁྲོད་དུ་ཞུགས་ཏེ་གནས་པའི་རིགས་ལས་དེང་སང་ནའང་བོད་ཅེས་བྱ་བར་གྲགས་པ་ཡིན་ནོ། །
en: As this battle was being fought, a king by the name of Rūpati, along with a single contingent of troops, dressed up as women and escaped to the snowy mountains. Their descendants remain there today and are known as the Tibetans.”

source: ཞེས་འབྱུང་བ་སོགས་འཆད་ཚུལ་སྣ་ཚོགས་ཞིག་སྣང་བ།
en: So, with this and other accounts, there are a variety of different ways to explain [the origins of the Tibetan people].

source: གང་ལྟར་ཡང་ཡུལ་འདིའི་སྐྱེ་བོ་དག་ལ་འཕགས་པ་ཐུགས་རྗེ་ཆེན་པོས་བྱིན་གྱིས་བརླབས་ཀྱིས་སྐྱོང་བར་མཛད་པ་ཞིག་ནི་གོར་མ་ཆག་ལ།
en: Nevertheless, that the people of this land are protected by the blessings of the Noble Great Compassionate One is beyond doubt.

source: དེ་ལྟ་བུའི་མི་ཡི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཡུལ་ལྗོངས་རིམ་པས་ལོངས་སྤྱོད་དུ་གྱུར་པ་ནས་བཟུང་། ཡུལ་དབུས་དག་ཏུ་ནགས་ཚལ་ཡང་རིམ་གྱིས་མེད་པར་གྱུར་ཏེ། གྲོང་དང་གྲོང་ཚོམ་དང་གྲོང་རྡལ་དང་རྒྱལ་པོའི་ཕོ་བྲང་དང་གཙུག་ལག་ཁང་ལ་སོགས་པས་ཀུན་ནས་བརྒྱན་པ་འདི་ལྟ་བུ་བྱུང་ངོ་། །
en: As human beings gradually availed themselves of the environment and settled the land, the forests in the central regions slowly disappeared, and villages, hamlets, and towns with royal palaces, temples, and the like came to adorn the landscape throughout, as it is now.

source: དེའང་ཡུལ་སྤྱིའི་དགེ་མཚན་གྱི་དབང་དུ་བྱས་ན་ཆོས་རྒྱལ་སྲོང་བཙན་སྒམ་པོས། དེ་ལྟར་འཕགས་པའི་གང་ཟག་རྣམས་འབྱུང་ཞིང་། །འཁོར་ནི་ལེགས་གནས་སྟོན་པའི་གསུང་རབ་དང་། །སྟོན་པའི་སྐུ་གཟུགས་དངོས་སུ་བཞུགས་པ་དང་། །
en: With regard to the virtuous qualities of the land in general, the Dharma king Songtsen Gampo praised it thus:

source: རི་བོ་ཡོན་ཏན་ཅན་ཡང་དེ་ན་ཡོད། །ཙཱ་རི་ཙ་གོང་བདེ་མཆོག་རང་བྱུང་དང་། །རྡོ་ཆུ་རིན་པོ་ཆེ་ཡང་དེ་ན་ཡོད། །ཏི་སེའི་གངས་ལ་དགྲ་བཅོམ་ལྔ་བརྒྱ་བཞུགས། །བདུད་རྩིའི་ཆུ་ཡང་རི་བོ་དེ་ན་ཡོད། །གྱེ་རེའི་བྲག་ལ་ཡིག་དྲུག་རང་བྱུང་དང་། །མཁའ་འགྲོའི་ཕྱག་རྒྱ་རི་བོ་དེ་ན་ཡོད། །
en: “As such, noble beings will appearWith the best of retinues, scriptures of the Teacher, And statues of the Teacher really present too.Even the mountains here possess great qualities.Cakrasaṃvara naturally dwells on Tsari Tsagong,Where even the rocks in the rivers are precious jewels.Five hundred arhats dwell on Mount Tisé, Where rivers of nectar are also to be found.Self-arisen syllables dot the cliffs of Gyeré, Where the handprints of ḍākinīs can be found.Lake Mapham is the abode of a bodhisattva nāga king,And its rivers possess immense qualities too.

source: མ་པང་མཚོ་ལ་ཀླུ་རྒྱལ་བྱང་སེམས་གནས། །ཆུ་བོ་ཡོན་ཏན་ཅན་ཡང་དེ་ན་ཡོད། །ཁྲི་བཤོས་རྒྱ་མཚོའི་ཀླུ་བློན་བྱང་ཆུབ་སེམས། །ཆུ་བོ་ཆེན་པོ་ཀུན་ལ་ཕན་པར་མཛད། །གནམ་མཚོ་ཕྱུག་མོའི་ནང་ན་བྱང་ཆུབ་སེམས། །ཐང་ལྷའི་བྲག་ལ་དགྲ་བཅོམ་ལྔ་བརྒྱ་ཡོད། །
en: Bodhisattva nāga ministers reside in Lake Tri Shö,Bringing benefit to all with its great rivers.

source: སྦུབས་མཚོའི་གླིང་ན་ཀླུ་རྒྱལ་བྱང་ཆུབ་སེམས། །ཁའུའི་གངས་ལ་དགྲ་བཅོམ་མང་པོ་ཡོད། །རི་མཐོ་ས་གཙང་གངས་རི་གཉན་གྱིས་བསྐོར། །སྒྲ་དག་སྐད་སྙན་སཾ་སྐྲྀ་ཏ་དང་མཚུངས། །མི་སྐད་ཆོས་ལ་བསྒྱུར་དུ་བཏུབ་པའི་སྒྲ། །ཡངས་ཤིང་མཐའ་ལེགས་ཡོན་ཏན་ཀུན་ལྡན་པ། །དེ་ལྟར་ཁ་བ་ཅན་གྱི་ཡུལ་དབུས་སུ། །
en: In Lake Namtso Chukmo dwell bodhisattvas, While on the Thanglha range are five hundred arhats.On an island in Lake Nuptso lives a bodhisattva nāga king,While on Mount Hawo are many arhats.With high peaks and pure earth, Tibet is fully encircled by snowy mountains.Its speech is pure and its language melodious, comparable to Sanskrit.The language of its people is fully capable of translating the Dharma.Vast and well bordered, this land is endowed with all virtuous qualities.Such is the Land of Snows, a central land.”

source: ཞེས་སོགས་ཀྱིས་བསྔགས་པ་མཛད་པ་ལྟར་དང་།
en: And also:

source: གམ་འབྲོག་རྒྱང་འབྲོག་རྩྭ་ཡི་དགེ། །ཁང་ས་ཞིང་ས་ས་ཡི་དགེ། །འཐུང་ཆུ་ཡུར་ཆུ་ཆུ་ཡི་དགེ། །ཁང་རྡོ་འཐག་རྡོ་རྡོ་ཡི་དགེ། ཁང་ཤིང་བུད་ཤིང་ཤིང་གི་དགེ། །
en: “Pastures near and pastures far, it has the virtues of grasslands.Land for building and land for farming, it has the virtues of land.Water for drinking and water for irrigation, it has the virtues of water.Stones for building and stones for milling, it has the virtues of stones.Wood for building and wood for burning, it has the virtues of wood.”

source: ཞེས་སོགས་བཤད་པ་ལྟར་དགེ་བཅུ་ཚང་ཞིང་ཁྱད་པར་དུ་མཁས་ཤིང་གྲུབ་པ་བརྙེས་པའི་སློབ་དཔོན་ཆེན་པོ་དང་།
en: So it has been described, as replete with ten virtues.

source: སྤྲུལ་པའི་ཆོས་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ས་ཆེན་པོ་ལ་གནས་པ་རྣམས་དང་།
en: In particular, it is a land thoroughly protected by the blessings of bodhisattvas who have dwelt on it—learned and realized masters, as well as emanated Dharma kings, and the incarnations of countless well-gone ones.

source: བདེ་བར་གཤེགས་པའི་སྤྲུལ་པའི་སྐུ་དུ་མ་བགྲང་བར་མི་སྤྱོད་པ་དག་གིས་བྱིན་གྱིས་བརླབས་ཤིང་ཡོངས་སུ་སྐྱོང་བར་མཛད་ཅིང་སྙིགས་མའི་དུས་སུ་སྟོན་པ་ཉིད་ཀྱིས་ལུང་དུ་བསྟན་པ་ལྟར་རྒྱལ་བའི་བསྟན་པ་ཆེས་ཆེར་གསལ་བར་གྱུར་པའི་གནས་ཕུན་སུམ་ཚོགས་པ་སྟེ།
en: As in the Teacher’s prophecy, it is a perfect place for the teachings of the Victorious One to shine brightly in this degenerate age.

source: གསང་སྔགས་རྡོ་རྗེ་ཐེག་པ་ལྟར་ན། རྡོ་རྗེ་མཁའ་འགྲོའི་རྒྱུད་ལས།
en: According to the Secret Mantra Vajrayāna, in the Vajraḍāka Tantra, it says:

source: བོད་ཡུལ་དུ་ནི་ལྷན་སྐྱེས་ཏེ། །ཞི་ཞིང་གསལ་བའི་གཟུགས་ཅན་མ། །ཆུ་སྲིན་རྒྱལ་མཚན་ལག་ན་ཐོགས། །བྲག་གི་ཁྱིམ་ལ་བརྟེན་ཏེ་གནས། །རང་བྱུང་གི་ནི་སྐྱེ་གནས་ཅན། །
en: “In the land of Tibet there is Sahajā,A goddess with a peaceful, lucid form.She holds the crocodile banner in her handAnd dwells on the rocky cliffs as her home,Bearing the womb of spontaneous arising.”

source: ཞེས་ཡུལ་ཉི་ཤུ་རྩ་བཞིའི་ཡ་གྱལ་དུ་གསུངས་ཤིང་། བོད་ཉིད་ཀྱི་ནང་གསེས་སུའང་རྡོ་རྗེའི་གནས་ཆེན་པོ་རྣམས་ཅི་རིགས་པར་ཚང་བ་ཡིན་ཏེ་གྲུབ་པའི་རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་ཆེན་པོ་རྣམས་ཀྱིས་ནང་གི་རྟེན་འབྲེལ་ཁྱད་པར་བ་རྣམས་བསྒྲིགས་པའི་ཡུལ་གྱི་གནད་གསང་ཐམས་ཅད་མ་ཚང་བ་མེད་པར་ཡོད་པའི་ཕྱིར་རོ། །
en: As such, the land of Tibet is said to be one of the twenty-four sacred places, and among the localities of Tibet itself there are all kinds of vajra sacred sites where accomplished yogic masters have formed extraordinary, inner interdependent connections associating all the secret points with physical sites.

source: དེ་ལྟ་བུའི་ཡོན་ཏན་དང་ལྡན་པའི་བསིལ་ལྡན་གྱི་ལྗོངས་སམ། ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་ལུང་བསྟན་པའི་མདོ་ལས་གདོང་དམར་ཅན་གྱི་ཡུལ་དུ་གསུངས་པ་འདི་ཉིད་ལ་བོད་དང་བོད་ཆེན་པོ་ཞེས་གཉིས་སུ་གྲགས་པ་ལས། བོད་ཆེན་པོའི་ལྗོངས་འདི་ནི་བོད་སྤྱིའི་འདྲ་དཔེ་སྟོད་དུ་མངའ་རིས་སྐོར་གསུམ་རྫིང་ལྟ་བུ་དང་། །
en: Imbued with the aforementioned qualities, this Cool Land, or the “land of the red-faced ones” as it is described in the sūtra The Questions of Vimalaprabha, is said to comprise “Tibet” and “Greater Tibet.” As for the region of Greater Tibet, a set of similes is given for Tibet at large: the three districts of Ngari up in the west are like a reservoir;

source: བར་དུ་དབུས་གཙང་རུ་བཞི་ཡུར་བ་ལྟ་བུ་དང་།
en: the four horns of Ütsang in the center are like an irrigation channel;

source: སྨད་དུ་མདོ་ཁམས་སྒང་དྲུག་ཞིང་ལྟ་བུའི་ཚུལ་དུ་བཤད་པའི་ཕྱི་མ་ཡིན་ཞིང་།
en: and the six ranges of Dokham down in the east are like a field.

source: དེ་ལས་མདོ་ཁམས་སྨད་དུ་གཏོགས་པའི་སའི་ཆ་གླིང་གི་ཡུལ་ཞེས་བྱ་བ་འདི་ནི་སྒང་དྲུག་ལས་ཟལ་མོ་སྒང་དུ་གྲགས་པ་སྟེ། ཆུ་བོ་ཆེན་པོ་བཞི་ལས་འབྲི་དང་ཤར་ཟླའི་ཆུ་ཀླུང་ཆེན་པོ་གཉིས་ཀྱི་བར་དུ་ཆུད་པ།
en: This location, which is called the land of Ling, falls in lower Dokham, amid what is known as the Zalmo range, one of the six mountain ranges, and between the Drichu and Shardachu Rivers among the four great rivers.

source: བདེ་གཤེགས་ཕག་མོ་གྲུ་པ་དང་། ཀཐོག་པ་དམ་པའི་མཚན་ཅན་དང་། གྲུབ་ཆེན་གསལ་སྟོང་ཤོ་སྒོམ་དང་། གྲུབ་པའི་དབང་ཕྱུག་ཀརྨ་པཀྵི་དང་། རྒྱལ་བའི་སྲས་པོ་སྤོམ་བྲག་པ་ལ་སོགས་པ་གྲུབ་པ་བརྙེས་པའི་རྡོ་རྗེ་སློབ་དཔོན་མང་པོ་བསམ་བཞིན་དུ་སྲིད་པ་ཉེ་བར་བཟུང་ཞིང་།
en: Many great accomplished vajra masters—such as Deshek Phakmo Drup, the one bearing the name of Kathokpa Dampa, the siddha Saltong Shogom, the accomplished lord Karma Pakṣi, the bodhisattva Pomdrak, and others—consciously took rebirth in this area and continue to watch over it.

source: དེ་དག་ལ་སོགས་པ་མཁས་ཤིང་གྲུབ་པའི་རྒྱལ་བའི་སྲས་པོ་མང་པོས་ཞབས་ཀྱིས་བཅགས་ཤིང་བྱིན་གྱིས་བརླབས་པས་སྐྱེ་དགུ་རྣམས་རང་བཞིན་གྱིས་དགེ་བ་ཅན་དུ་གནས་པའི་ཡུལ།
en: With so many learned and accomplished bodhisattvas who have graced this land with their feet and conferred their blessings upon it, the inhabitants are naturally inclined toward virtue.

source: སློབ་དཔོན་པདྨ་སཾ་བྷ་ཝ་ལ་སོགས་པའི་སྤྱན་སྔར་དམ་མནོས་པའི་འབྱུང་པོ་ཆེན་པོ་དཀར་ཕྱོགས་ལ་དགའ་བ་རྣམས་ཀྱིས་ཡོངས་སུ་སྲུང་ཞིང་བདེ་བར་གཤེགས་པའི་བསྟན་པ་གཙོ་བོར་སྒྲུབ་པ་ཉམས་ལེན་གྱི་སྒོ་ནས་ཆེས་ཤིན་ཏུ་གསལ་བའི་ཕྱོགས།
en: The land is protected by great bhūtas who have sworn oaths before Ācārya Padmasaṃbhava and others and favor the forces of good. Above all, the land is brilliantly illuminated by the practice of the Well-Gone One’s teachings.

source: བསྔགས་པ་དུ་མས་བསྔགས་པར་འོས་པ་འདི་ཉིད་དོ། །
en: In light of all this, this land is more than worthy of copious praise.

source: དེ་ལས་ཀྱང་ལེགས་བྱས་རྒྱ་ཆེན་པོ་འདི་མངོན་པར་འདུ་བྱེད་པའི་ཡུལ་དངོས་ནི་གཡས་རི་གཡུ་འབྲུག་འགྱིང་བ་ལྟ་བུ།
en: Furthermore, the actual location for this vast virtuous deed [the production of this Kangyur] is the great monastic college of Palden Lhundrup Teng.

source: གཡོན་རི་སེང་གེ་གནམ་དུ་འཕྱོ་བ་ལྟ་བུ། རྒྱབ་རི་ཤེལ་གྱི་མཆོད་རྟེན་ལྟ་བུ། མདུན་རི་གླང་པོ་ཆེ་འདུད་པ་ལྟ་བུ། གསེར་ལྡན་གྱི་རྒྱུན་དབང་གི་ཕྱོགས་ནས་དལ་བུའི་འབབ་པ་སོགས་སའི་དཔྱད་ལེགས་རྒུ་མ་ཚང་བ་མེད་པའི་དབུས་སུ་དཔལ་ས་ལྡན་ལྷུན་གྲུབ་སྟེང་གི་ཆོས་གྲྭ་ཆེན་པོ།
en: Lhundrup Teng is located at the center of a number of remarkable geomantic signs: the mountain on its right resembles a poised turquoise dragon, the mountain to its left resembles a lion jumping in the sky, the mountain behind it resembles a crystal stupa, the mountain in front of it resembles a bowing elephant, and the current of its golden river leisurely flows to the west, the direction of magnetizing.

source: དགེ་འདུན་གྱི་སྡེ་རྣམས་ཀྱང་། རྗེ་བཙུན་ས་སྐྱ་པ་ཆེན་པོ་ཡབ་སྲས་ནས་ཉེ་བར་བརྒྱུད་དེ། རྗེ་བཙུན་ཐམས་ཅད་མཁྱེན་པ་རྡོ་རྗེ་འཆང་ཀུན་དགའ་བཟང་པོས་ངེས་གསང་གི་གནད་ཐམས་ཅད་ལེགས་པར་ཕྱེ་བའི་རྒྱུན་དྲི་མ་མེད་པ་འཛིན་པར་མཛད་ཅིང་།
en: The monastic community is in the lineage of the venerable great Sakyapas, father and sons, and excellently upholds the immaculate lineage of all the key points of the definitive secret as taught by the venerable and omniscient Vajradhara Künga Sangpo.

source: ཀློག་པ་ཐོས་བསམ་གྱི་འཁོར་ལོ་དང་། བྱ་བ་ནན་ཏན་གྱི་འཁོར་ལོ་རྣམ་པ་གཉིས་ཀྱིས་དུས་འདའ་བ་རྒྱུད་སྡེ་མང་པོའི་བསྐྱེད་རྫོགས་ཀྱི་རྣལ་འབྱོར་ཟབ་མོ་དང་། དཀྱིལ་འཁོར་གྱི་ལས་རབ་འབྱམས་དང་། སྨིན་གྲོལ་གྱི་བཀའ་ཟབ་མོ་སོགས་མ་ནུབ་ཅིང་ཆེས་གསལ་བ་སོགས་རྣམ་གྲངས་དུ་མས་བསྔགས་པར་འོས་པ་འདི་ཉིད་དུ།
en: Spending time in both the wheel of study and reflection, and the wheel of diligent practice, they uphold and do not let fade the light of the profound yogas of generation and completion, the infinite activities of the maṇḍalas, and the profound instructions of ripening and liberating and so on, and are worthy of many tributes of praise.

source: རྒྱལ་ཁབ་ཀྱི་ཕོ་བྲང་ཆེན་པོ། བདེ་བར་གཤེགས་པའི་སྐུ་གཟུགས་ལུགས་མ་དང་། རི་མོར་བྲིས་པ་སོགས་དང་། སྡེ་སྣོད་གསུམ་གྱི་པུསྟ་ཀ་དུ་མ་སོགས་རིན་ཐང་དང་བྲལ་བའི་རིན་པོ་ཆེའི་ཚོགས་དུ་མས་བྱུར་བུར་བཀང་བས་གཙུག་ལག་ཁང་ཆེན་པོར་གྱུར་པ། འཕགས་ཡུལ་གྱི་རནྡྷ་ཀུ་ཊ་བི་ཧ་ར་ཇི་ལྟ་བ་བཞིན་དུ་གྲགས་པ་མངོན་པར་གསལ་བ་འདིའོ། །
en: This great palace of the kingdom, filled to overflowing with priceless collections of precious items—cast statues and painted images of the well-gone ones, many volumes of the three scriptural baskets, and more—is a great temple, evidently comparable to how the ratnakūṭa vihāras were said to be in the noble land of India.

source: གཉིས་པ་དེ་ལྟ་བུའི་ཡུལ་དུ་བྱུང་བའི་མིའི་དབང་པོ་འདིའི་རིགས་རྒྱུད་ཀྱི་ཁྱད་པར་ནི།
en: 1.2 Family Lineage I will now present the particularities of the family lineage of the Lord of Men, Tenpa Tsering, who came from this land.

source: མི་དབང་འདི་ཉིད་ཀྱི་དྲུང་ཡིག་པ་འཇམ་དབྱངས་དགའ་བའི་བློ་གྲོས་ཀྱིས་ཡིག་ཚང་ཁུངས་མ་ལས་བཏུས་པའི་གཏམ་གྱི་སྦྱོར་བ་བྱས་པ་ལྟར་འགོད་ན། །
en: This will be done according to the narrative compiled by his own secretary, Jamyang Gawai Lodrö, which was based on documents from their archives.

source: དེའང་བོད་ཆེན་པོའི་ལྗོངས་འདིར་སྤྱིར་སྒྲ་འབྲུ་སྟོང་སྒ་སྟེ་རུས་ཆེན་བཞི་དང་། སྒོ་ལྷ་སྡེ་དཀར་པོའི་རིགས་ཏེ་མི་རིགས་ལྔ་བྱུང་བར་གྲགས་པ་ལས་ཕྱི་མ།
en: In general, there are said to be five peoples in this region of Greater Tibet: the four great ancestral clans—the Dra, the Dru, the Dong, and the Ga—plus the pure divine tribe of Go.

source: དེ་ལས་ཀྱང་བྱེ་བྲག་ཏུ་རྔུ་ཆེན་རྒྱལ་མོ་ཚོ་བཅོ་བརྒྱད་དུ་གྲགས་པ་འགར་ཀེ་འགོལ་གསུམ།
en: The last of these, it is said, consisted of the eighteen tribes of Nguchen Gyalmo.

source: གསུང་གསེར་འབྲོམ་གསུམ།
en: These are, namely, the Gar, Ké, and Göl;

source: ཅི་འབུ་གཞག་གསུམ།
en: the Sung, Ser, and Drom;

source: ཤོལ་སྟག་ཕྱིང་གསུམ།
en: the Chi, Bu, and Shak;

source: གཅེ་སིང་རམ་གསུམ།
en: the Shöl, Tak, and Chang;

source: ཕྱུག་པོ་བུ་གསུམ་རྣམས་ལས་འགར་གྱི་རིགས་འགར་ཆེན་ཡེ་ཤེས་བཟང་པོ་དང་།
en: the Jé, Sing, and Ram;

source: འགར་དམ་པར་གྲགས་པ་སྐུ་མཆེད་གཉིས་བྱུང་སྟེ།
en: and the Chuk, Po, and Bu. Among those, in the Gar lineage, there were two brothers by the names of Garchen Yeshé Sangpo and Gar Dampa.

source: དེ་ལས་ཕྱི་མ་ནི། དྲུང་ཡིག་པས་བཀོད་པའི་ཡི་གེ་དེ་ཉིད་དང་བསྟུན་ན་སྤོ་བོ་ཕུ་ལུང་དགོན་པ་སོགས་དང་སྦྱར་བས་ལོ་རྒྱུས་མ་དག་པ་མ་གཏོགས་འགར་དམ་པ་ཆོས་སྡིངས་པ་ཡིན་པར་མངོན་ཏེ། དེ་ནི་སིངྷ་ལའི་སློབ་དཔོན་ཨཱརྱ་དེ་ཝའི་རྣམ་འཕྲུལ་དུ་གྲགས།
en: According to the secretary’s writings, the latter was connected with Phulung monastery in Powo and so on, so unless the account is inaccurate, it is clear that this refers to Gar Dampa Chödingpa, who is said to have been an emanation of the Sinhalese master Āryadeva.

source: ཡབ་མེས་རྣམས་རྡོ་རྗེ་འཇིགས་བྱེད་ཀྱི་རྣལ་འབྱོར་པ་ཡིན་པས་སྐུ་ཆུང་ངུའི་དུས་ནས་འཇིགས་བྱེད་ལ་ཐུགས་དམ་མཛད།
en: Gar Dampa Chödingpa’s ancestors were all practitioners of Vajrabhairava, and he too made a sacred commitment to Bhairava from a young age.

source: འབྲི་ཁུང་དུ་བྱོན་ནས་འཇིག་རྟེན་གསུམ་གྱི་མགོན་པོ་བརྟེན་ཏེ་གྲུབ་པའི་དབང་ཕྱུག་ཆེན་པོར་གྱུར།
en: He traveled to Drigung where he took Jikten Sumgyi Gönpo as his teacher and became an accomplished yogic master.

source: ཙ་རིར་བྱོན་ཏེ་གསང་སྔགས་ཀྱི་སྤྱོད་པ་བསྐྱངས།
en: He later traveled to Tsari where he continued his practices of Secret Mantra.

source: དྭགས་པོ་འགར་ཕུག་ཏུ་བཞུགས་པའི་ཚེ་བོད་ཀྱི་ལྷ་འདྲེ་ཐམས་ཅད་འདུས་ནས་སྐུ་ལུས་ཟངས་ཐལ་དུ་འགྲོ་བའི་མཚོན་ཆ་མང་པོ་བརྒྱབ་ཀྱང་ཉམ་ང་མེད་པས་ཐམས་ཅད་ཀྱིས་སྐྱབས་སུ་སོང་སྟེ་སྲོག་སྙིང་ཕུལ།
en: While dwelling in the Gar cave in Dakpo, he summoned all of Tibet’s deities and demons. They launched an assault on him with a multitude of weapons that should have reduced his body to ash; nevertheless, his fearless attitude compelled them all to take refuge in him and dedicate their lives to him.

source: ཕྲིན་ལས་མང་པོ་མཛད་ནས་ཕྱིས་སྤོ་བོར་ཕེབས།
en: Performing a wide range of other beneficial activities, he eventually made his way to Powo.

source: དེར་ཆོས་ཡེ་མི་དར་བ་ལ་རྫུ་འཕྲུལ་དང་ཐབས་མཁས་ཀྱིས་སྐྱེ་བོ་དད་པར་བྱས་ནས་ཕུ་ལུང་དགོན་པ་རིན་ཆེན་གླིང་གི་གཞི་བཏིང་ནས་ཞི་བར་གཤེགས།
en: Since the Dharma had not spread there before, he inculcated faith in the people with his miraculous powers and skillful means. After he laid the foundation for Phulung Rinchen Ling monastery, he passed away.

source: དེ་ནས་ཉིད་ཀྱི་དབོན་པོ་ཨུ་རྒྱན་ལ་སོགས་པ་ཁམས་ནས་འོངས་ཏེ་དེའི་འཕྲོ་བསྐྱངས།
en: Then his nephew Orgyen, along with some others, came from Kham to oversee its continuation.

source: དེ་ལས་དབོན་རྒྱུད་རིམ་བྱུང་བ་ཕུ་ལུང་སྡེ་པ་ཐོག་ཀ་བར་གྲགས་ཏེ་དུས་ཕྱིས་ཀྱི་བར་དུ་ཡོད་དོ། །
en: A family lineage thereby gradually emerged known as the Phulung Dépa Thokawa, which continued in later times.

source: འགར་ཆེན་ཡེ་ཤེས་བཟང་པོས་སླང་མདོ་དྲུག་གིས་འཆི་བདག་གིར་མཛད་དེ།
en: As for Garchen Yeshé Sangpo, he became ruler of the Langdodruk area.

source: དེའི་སྲས་གཉིས་ཀྱི་བསོད་ནམས་རིན་ཆེན་གྱིས་འགྲོ་མགོན་ཆོས་རྒྱལ་འཕགས་པའི་ཞབས་པད་ས་བརྟེན་ནས་གསོལ་དཔོན་གྱི་ལས་ཀ་བཟུང་།
en: One of his two sons, Sönam Rinchen, served at the lotus feet of Drogön Chögyal Phakpa and was made his chamberlain.

source: གོང་མ་སེ་ཆེན་གན་གྱིས་དམག་དང་འཇའ་ས་སོགས་བྱིན་ཏེ་ཆེན་པོའི་གོ་སར་དབང་བསྐུར།
en: He was also granted an official seal and edict and so on from the emperor Kublai Khan, investing him with a position of great importance.

source: དེ་ནས་སྐུ་ཚེའི་སྨད་ལ་ས་དམར་ཡང་དགོན་དུ་ཚོགས་པ་སྟོང་ཕྲག་ཙམ་བསྐྱངས།
en: In the later part of his life, Sönam Rinchen looked after some one thousand monks at the Samar Yangön monastery.

source: དེའི་དབོན་པོ་རྔུ་རྒུ་རུ་ལ་སྲས་དགུ་བྱུང་བའི་ནང་ནས་སྟོང་དཔོན་ཟླ་བ་བཟང་པོ་ཞེས་པ་ལ་གོང་མ་མཆོད་ཡོན་གྱིས་ས་དམར་སྟོང་དཔོན་གྱི་ལས་ཀ་གནང་བས་མངོན་པར་མཐོ་བ་བྱུང་།
en: His nephew, Ngu Guru, had nine sons, one of whom was Tongpön Dawa Sangpo, who as a result of the priest-patron relationship with the emperor ascended to the position of tongpön of Samar.

source: དེའི་སྲས་གཉིས་ལས་རྡུ་རྒྱལ་བ་བཟང་པོའི་སྲས་པདྨ་བསྟན་སྲུང་།
en: One of Tongpön Dawa Sangpo’s two sons, Ngu Gyalwa Sangpo, had a son called Pema Tensung.

source: དེའི་སྲས་དཀར་ཆེན་བྱང་ཆུབ་འབུམ། དེའི་སྲས་རྡུ་ཆོས་རྡོར་བ་ནི་གསང་ཆེན་རྙིང་མའི་གྲུབ་ཐོབ་ཆེན་པོར་གྱུར།
en: He, in turn, had a son named Karchen Jangchup Bum, whose son, Ngu Chödorwa, was a mahāsiddha in the great esoteric Nyingma tradition.

source: དེའི་མཆེད་ཡོ་དགེ་འདུན་རྒྱལ་མཚན་གྱི་སྲས་མགོན་པོ་གཟུངས་སོགས་ལས་བརྒྱུད་དེ་དེང་སང་གི་བར་དུ་ས་དམར་ཕྱོགས་འདིར་རྒྱུན་མ་ཆད་པར་ཡོད་དོ། །དཀར་ཆེན་བྱང་ཆུབ་འབུམ་གྱི་སྲས།
en: His brother, Gendün Gyaltsen, had a son named Gönpo Sung, whose family lineage in the Samar area remains unbroken until today.

source: བདེ་ཆེན་བསོད་ནམས་བཟང་པོ་ཞེས་པ་ཡུམ་འདས་པའི་དགོངས་རྫོགས་བསྒྲུབ་པར།
en: A son of Karchen Jangchup Bum by the name of Dechen Sönam Sangpo traveled to Kathok Dorjeden to perform funerary rites on behalf of his late mother.
